Revit 2027 API
Railing.Flipped Property
 Indicates if the railing is flipped.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Flipped { get; }
Public ReadOnly Property Flipped As Boolean
	Get
public:
property bool Flipped {
	bool get ();
}
member Flipped : bool with get
Property Value
Boolean
Exceptions
Exception | Condition
InapplicableDataException |  The railing has incorrect internal data.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace